In [1]:
from Repositories.NorthwindRepository import Repository

In [2]:
northwindConnectionString = "Driver={SQL Server};Server=DESKTOP-8INVJ1O\SQLEXPRESS;Database=Northwind;trusted_connection=yes"
northwindRepository = Repository(northwindConnectionString)

# PRODUCT

In [3]:
productDataFrame = northwindRepository.getProductDataFrame()
productDataFrame

C:\Users\Max\Documents\GitHub\Scripts\DataHandling\Merging\Repositories\NorthwindRepository.py:18: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  productData = pd.read_sql(productJoinQuery, self.dbConnection)

    PRODUCT_id                     PRODUCT_name PRODUCT_sub_category
0            1                             Chai            Beverages
1            2                            Chang            Beverages
2            3                    Aniseed Syrup           Condiments
3            4     Chef Anton's Cajun Seasoning           Condiments
4            5           Chef Anton's Gumbo Mix           Condiments
..         ...                              ...                  ...
72          73                       Röd Kaviar              Seafood
73          74                    Longlife Tofu              Produce
74          75             Rhönbräu Klosterbier            Beverages
75          76                     Lakkalikööri            Beverages
76          77  Original Frankfurter grüne Soße           Condiments

[77 rows x 3 columns]

# CUSTOMER

In [4]:
customerDataFrame = northwindRepository.getCustomerDataFrame()
customerDataFrame

C:\Users\Max\Documents\GitHub\Scripts\DataHandling\Merging\Repositories\NorthwindRepository.py:31: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  customerData = pd.read_sql(customerJoinQuery, self.dbConnection)

,CUSTOMER_id,CUSTOMER_address,CUSTOMER_city,CUSTOMER_country,CUSTOMER_company_name
0,ALFKI,Obere Str. 57,Berlin,Germany,Alfreds Futterkiste
1,ANATR,Avda. de la Constitución 2222,México D.F.,Mexico,Ana Trujillo Emparedados y helados
2,ANTON,Mataderos 2312,México D.F.,Mexico,Antonio Moreno Taquería
3,AROUT,120 Hanover Sq.,London,UK,Around the Horn
4,BERGS,Berguvsvägen 8,Luleå,Sweden,Berglunds snabbköp
...,...,...,...,...,...
86,WARTH,Torikatu 38,Oulu,Finland,Wartian Herkku
87,WELLI,"Rua do Mercado, 12",Resende,Brazil,Wellington Importadora
88,WHITC,305 - 14th Ave. S. Suite 3B,Seattle,USA,White Clover Markets
89,WILMK,Keskuskatu 45,Helsinki,Finland,Wilman Kala
90,WOLZA,ul. Filtrowa 68,Warszawa,Poland,Wolski Zajazd

# Employee

In [5]:
employeeDataFrame = northwindRepository.getEmployeeDataFrame()
employeeDataFrame

C:\Users\Max\Documents\GitHub\Scripts\DataHandling\Merging\Repositories\NorthwindRepository.py:45: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  employeeData = pd.read_sql(employeeJoinQuery, self.dbConnection)

   EMPLOYEE_id EMPLOYEE_first_name EMPLOYEE_city EMPLOYEE_country
0            1               Nancy       Seattle              USA
1            2              Andrew        Tacoma              USA
2            3               Janet      Kirkland              USA
3            4            Margaret       Redmond              USA
4            5              Steven        London               UK
5            6             Michael        London               UK
6            7              Robert        London               UK
7            8               Laura       Seattle              USA
8            9                Anne        London               UK

# Date

In [6]:
DAY_date = northwindRepository.getDayDataFrame()
DAY_date

C:\Users\Max\Documents\GitHub\Scripts\DataHandling\Merging\Repositories\NorthwindRepository.py:53: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  orderDates = pd.read_sql("SELECT DISTINCT OrderDate FROM orders", self.dbConnection)

      DAY_date DAY_MONTH_nr DAY_QUARTER_nr DAY_YEAR_nr
0   1996-07-04            7              3        1996
1   1996-07-05            7              3        1996
2   1996-07-08            7              3        1996
3   1996-07-09            7              3        1996
4   1996-07-10            7              3        1996
..         ...          ...            ...         ...
475 1998-04-30            4              2        1998
476 1998-05-01            5              2        1998
477 1998-05-04            5              2        1998
478 1998-05-05            5              2        1998
479 1998-05-06            5              2        1998

[480 rows x 4 columns]

# Order Details

In [7]:
orderDetailsData = northwindRepository.getOrderDetailsDataFrame()
orderDetailsData

C:\Users\Max\Documents\GitHub\Scripts\DataHandling\Merging\Repositories\NorthwindRepository.py:68: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  orderDetailsData = pd.read_sql(orderDetailsQuery, self.dbConnection)

,ORDER_DETAIL_id,ORDER_HEADER_id,ORDER_DETAIL_order_quantity,ORDER_DETAIL_unit_price,DAY_date,EMPLOYEE_id,CUSTOMER_id,PRODUCT_id
0,10248,10248,12,14.00,1996-07-04,5,VINET,11
1,10248,10248,10,9.80,1996-07-04,5,VINET,42
2,10248,10248,5,34.80,1996-07-04,5,VINET,72
3,10249,10249,9,18.60,1996-07-05,6,TOMSP,14
4,10249,10249,40,42.40,1996-07-05,6,TOMSP,51
...,...,...,...,...,...,...,...,...
2150,11077,11077,2,33.25,1998-05-06,1,RATTC,64
2151,11077,11077,1,17.00,1998-05-06,1,RATTC,66
2152,11077,11077,2,15.00,1998-05-06,1,RATTC,73
2153,11077,11077,4,7.75,1998-05-06,1,RATTC,75
2154,11077,11077,2,13.00,1998-05-06,1,RATTC,77